Repository: Lilium27/Creating-Intelligent-Content-with-Lightweight-DITA-Translation-Project
Catalog: omegat/project_save.tmx
Source language: en
Languages: zh_cn

source: • Darwin: for specialization and how things could “evolve” from a base • Information Typing: for representation of knowledge as typed units • Architecture: a statement that this was not just a monolithic design but an extensible tool that could support many uses (Day, quoted in DITAWriter, 2016).
zh_cn: •达尔文：代表专业化以及事物如何从一个基础“演化”；•信息类型化：用不同类型单元表示知识； • 架构：表示这不仅仅是一个整体设计理念，还是一个可扩展的工具，可以支持多种用途（戴，引自 DitaWriter，2016年）。

source: • Define your terms
zh_cn: • 定义术语

source: • Divide your material into short steps
zh_cn: • 将材料划分为精简的步骤

source: • Elements are “the units that physically constitute technical information.
zh_cn: • 元素是“物理上构成技术信息的实体单元”。

source: • Explaining the Distinguishing Characteristics of the Product or Procedure • Illustrating the Old Product or Procedure
zh_cn: • 说明产品或流程的显著特征 • 说明旧产品或流程

source: • Give people a break
zh_cn: • 帮用户分解任务

source: • Greater emphasis on the embedded assistance in user interfaces
zh_cn: • 更加强调在用户界面中的嵌入式帮助

source: • Guidelines are “brief directives about what to do or not to do to achieve the characteristics of quality.
zh_cn: • 指导方针是“关于为了达到质量特征该做什么或不做什么的简要指示。”

source: • Highlight components
zh_cn: · 高亮组件

source: • Illustrating the New Product or Procedure
zh_cn: • 说明新产品或流程

source: • Introduce each section
zh_cn: • 介绍每节的内容

source: • Map elements: 10, including <map>, <navref>, and <topicref>
zh_cn: • 映射元素： 10, 包括 <map>, <navref>, 和 <topicref>

source: • Map group elements: 2, consisting of <topicgroup> and <topichead>
zh_cn: • 映射组元素 2, 包括 of <topicgroup> 和 <topichead>

source: • Metadata components
zh_cn: · 元数据组件

source: • Miscellaneous elements: 5, including <draft-comment>, <fn>, and <indexterm> • Prolog elements: 27, including <audience>, <author>, and <platform> • Related links elements: 5, including <link>, <linkinfo>, and <linktext> • Specialization elements: 6, including <boolean>, <no-topic-nesting>, and <required-cleanup>
zh_cn: • 其他元素：5, 包括 <draft-comment>, <fn>, 和 <indexterm> • Prolog元素： 27, 包括 <audience>, <author>, 和 <platform> • 相关链接元素：5, 包括 <link>, <linkinfo>, 和 <linktext> • 专门化元素：6, 包括 <boolean>, <no-topic-nesting>, 和 <required-cleanup>

source: • Multimedia components.
zh_cn: · 多媒体组件

source: • Outlining the Task
zh_cn: • 给任务设计大纲

source: • Presenting the Alternatives Sheet
zh_cn: • 显示备选方案表

source: • Presenting the Troubleshooting Table (Cohen & Cunningham, 1984).
zh_cn: • 显示故障排除表 (Cohen & Cunningham, 1984).

source: • Programming elements: 25, including <codeblock>, <apiname>, and <syntaxdiagram>
zh_cn: • 编程元素：25, 包括 <codeblock>, <apiname>, 和 <syntaxdiagram>

source: • Put in lots of displays
zh_cn: • 加入大量展示

source: • Put in pictures
zh_cn: • 加入图片s

source: • Reference elements: 12, including <reference>, <refbody>, and <refsyn> • Task elements: 25, including <task>, <taskbody>, and <steps>
zh_cn: • 参考元素：12, 包括 <reference>, <refbody>, 和 <refsyn> • 任务元素： 25, 包括 <task>, <taskbody>, 和 <steps>

source: • Show people how to get out
zh_cn: • 向用户展现如何实现

source: • Software elements: 8, including <varname>, <userinput>, and <systemoutput> • User interface elements: 5, including <wintitle>, <menucascade>, and <screen>
zh_cn: • 软件元素：8, 包括 <varname>, <userinput>, 和 <systemoutput> • 用户界面元素： 5, 包括 <wintitle>, <menucascade>, 和 <screen>

source: • Summarize
zh_cn: • 总结

source: • Table components
zh_cn: · 表格组件

source: • Table elements: 11, including <table>, <row>, and <entry>
zh_cn: • 表格元素： 11, 包括 <table>, <row>, 和 <entry>

source: • Task orientation
zh_cn: • 任务导向

source: • Tell people where to go next (Price, 1984).
zh_cn: • 告知下一步 (Price, 1984).

source: • Test it.
zh_cn: • 验证

source: • The marinara sauce recipe (structured as a DITA task)
zh_cn: • 意式番茄罗勒酱菜谱（以 DITA 任务（task）话题的结构编写）

source: • The need to plan for information access from mobile devices
zh_cn: • 需要考虑从移动设备上获取信息

source: • The pervasiveness of Google and other search engines as users' preferred method for looking for information
zh_cn: • 用户更倾向于在Google和其他搜索引擎上查找信息

source: • Topic elements: 11, including <dita>, <topic>, and <title>
zh_cn: • 主题元素：11, 包括 <dita>, <topic>, 和 <title>

source: • Typographic elements: 6, including <b>,<i>, and <u>
zh_cn: • 排版元素：6, 包括 <b>,<i>, 和 <u>

source: • Utilities elements: 4, including <imagemap>, <area>, and <shape>
zh_cn: • 实用程序元素：4, 包括 <imagemap>, <area>, 和 <shape>

source: • Video as a delivery medium for technical information (Carey et al., 2014, p.
zh_cn: • 视频作为技术信息的传递媒介(Carey et al., 2014, p.

source: • agrees
zh_cn: • 约定

source: • at this (that) point in time
zh_cn: • 在目前（那种）情况下

source: • because
zh_cn: • 因为

source: • can
zh_cn: • 能

source: • draws a conclusion
zh_cn: • 得出……结论draws a conclusion

source: • due to the fact that
zh_cn: • 考虑到……

source: • has a requirement
zh_cn: • 有……需求

source: • has the capability
zh_cn: • 有……能力

source: • helps
zh_cn: • 帮助

source: • if
zh_cn: • 如果

source: • in the event that
zh_cn: • 在……情况下

source: • infers
zh_cn: • 推断

source: • is capable
zh_cn: • 可以

source: • is in agreement
zh_cn: • 与……一致

source: • now (then)
zh_cn: • 现在（当时）

source: • performs the printing
zh_cn: • 完成打印

source: • prints
zh_cn: • 打印

source: • provides assistance
zh_cn: • 提供协助

source: • requires
zh_cn: • 需要

source: • “The all-inclusive edition is designed for authors and publishers who develop and deliver well-structured, modular instructional materials.
zh_cn: • “全能版是为需要开发和交付良好结构、模块化的教学材料的作者和出版商设计的。

source: • “The base edition is designed for application developers and people who need only the most fundamental pieces of the DITA framework”
zh_cn: • 基础版是为应用程序开发人员和只需要DITA框架最基本部分的人设计的。

source: • “The technical content edition is designed for authors who document complex applications and devices, such as software, hardware, medical devices, machinery, and more”
zh_cn: • “技术内容版是为编写复杂应用程序和设备(如软件、硬件、医疗设备、机械等)的作者而设计的。”
